### Load ipython-sql extension

In [1]:
# The 2 lines below prevent an error message from being displayed when we run %load_ext sql
import warnings
warnings.filterwarnings('ignore')

%load_ext sql
%config SqlMagic.feedback = False

### Connect to the database

In [2]:
%%sql

postgresql://localhost/dvdrental

'Connected: None@dvdrental'

### Sample data

In [4]:
%%sql

SELECT
    *
FROM
    category c

[(1, 'Action', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (2, 'Animation', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (3, 'Children', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (4, 'Classics', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (5, 'Comedy', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (6, 'Documentary', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (7, 'Drama', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (8, 'Family', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (9, 'Foreign', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (10, 'Games', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (11, 'Horror', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (12, 'Music', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (13, 'New', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (14, 'Sci-Fi', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (15, 'Sports', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (16, 'Travel', datetime.datetime(2006, 2, 15, 9, 46, 27))]

### Using LIMIT

In [3]:
%%sql

SELECT
    *
FROM
    category c
LIMIT
    5

[(1, 'Action', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (2, 'Animation', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (3, 'Children', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (4, 'Classics', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (5, 'Comedy', datetime.datetime(2006, 2, 15, 9, 46, 27))]

### Removing the first *n* results

In [12]:
%%sql

SELECT
    *
FROM
    category c
LIMIT
    5
OFFSET
    5

[(6, 'Documentary', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (7, 'Drama', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (8, 'Family', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (9, 'Foreign', datetime.datetime(2006, 2, 15, 9, 46, 27)),
 (10, 'Games', datetime.datetime(2006, 2, 15, 9, 46, 27))]